lilytorch/farms_examples/_1guillasim/precice_coupling/openfoam_case/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.215971 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.215971 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    front
    {
        type            slip;
    }
    back
    {
        type            slip;
    }
    swimmer
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}
