lilytorch/farms_examples/_1guillasim/precice_coupling/openfoam_case/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    front
    {
        type            slip;
    }
    back
    {
        type            slip;
    }
    swimmer
    {
        type            zeroGradient;
    }
}
