lilytorch/farms_examples/_1guillasim/precice_coupling/openfoam_case/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs (fvMotionSolvers);

motionSolver    displacementLaplacian;

displacementLaplacianCoeffs
{
    diffusivity     inverseDistance (swimmer);
}
