lilytorch/farms_examples/_1guillasim/precice_coupling/openfoam_case/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Water properties matching the BDIM config
// nu = 1.0e-6 m^2/s (kinematic viscosity)
// rho = 1000 kg/m^3

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1.0e-06;
