lilytorch/farms_examples/_1guillasim/precice_coupling/openfoam_case/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;

