lilytorch/farms_examples/_1guillasim/precice_coupling/openfoam_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Domain: [-0.9, 1.5] x [-0.3, 0.3] x [0.1, 0.3]
// The z-extent is 20 cm centred around z=0.2 where the swimmer
// spawns (ground_height=0.2 in FARMS).

scale   1;

xmin   -0.9;
xmax    1.5;
ymin   -0.3;
ymax    0.3;
zmin    0.1;
zmax    0.3;

// Resolution: 960 x 240 x 40 (background mesh — snappyHexMesh refines near body)
vertices
(
    ($xmin $ymin $zmin)   // 0
    ($xmax $ymin $zmin)   // 1
    ($xmax $ymax $zmin)   // 2
    ($xmin $ymax $zmin)   // 3
    ($xmin $ymin $zmax)   // 4
    ($xmax $ymin $zmax)   // 5
    ($xmax $ymax $zmax)   // 6
    ($xmin $ymax $zmax)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (240 60 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    front
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    back
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);
