lilytorch/farms_examples/_1guillasim/precice_coupling/openfoam_case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         12;

deltaT          0.001;

writeControl    timeStep;
writeInterval   200;

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;

writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }

    forces
    {
        type            forces;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;

        patches         (swimmer);
        rho             rhoInf;
        rhoInf          1000;
        CofR            (0 0 0);
    }

    vorticity
    {
        type            vorticity;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

}
