lilytorch/farms_examples/_1guillasim/precice_coupling/openfoam_case/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  24;

method          scotch;
