lilytorch/farms_examples/_1guillasim/precice_coupling/openfoam_case/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    pcorr
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-04;
        relTol          0;
        nCellsInCoarsestLevel 20;
        maxIter         500;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
        nCellsInCoarsestLevel 20;
        maxIter         500;
    }

    pFinal
    {
        $p;
        relTol          0;
        maxIter         1000;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.01;
        maxIter         500;
    }

    UFinal
    {
        $U;
        relTol          0;
        maxIter         1000;
    }

    cellDisplacement
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0.001;
        maxIter         200;
    }

    cellDisplacementFinal
    {
        $cellDisplacement;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    3;
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    equations
    {
        "U.*"           0.7;
    }
    fields
    {
        "p.*"           0.7;
    }
}
