lilytorch/farms_examples/_1guillasim/precice_coupling/openfoam_case/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig   "precice-config.xml";

participant     OpenFOAM;

modules (FSI);

interfaces
{
    Interface1
    {
        mesh              OpenFOAM-Mesh;
        patches           (swimmer);
        locations         faceCenters;

        readData
        (
            Displacement
        );

        writeData
        (
            Force
        );
    };
};

FSI
{
    // OpenFOAM reads displacement from FARMS and writes forces back
    // For incompressible solvers: rho is dimensioned kg/m^3
    rho                     rho [1 -3 0 0 0 0 0] 1000;
    namePointDisplacement   pointDisplacement;
    nameCellDisplacement    cellDisplacement;
}
